'use strict'

module.exports = {

    /**
     * 必选参数缺失
     */
    '缺少必要参数': '缺少必要参数',

    '授权未能通过': '授权未能通过',

    '参数%s格式校验失败': '参数%s格式校验失败',

    '参数%s校验失败': '参数%s校验失败',

    '节点资源校验失败': '节点资源校验失败',

    '节点信息校验失败': '节点信息校验失败',

    '合同信息校验失败': '合同信息校验失败',

    '节点资源与节点不匹配': '节点资源与节点不匹配',

    '文件丢失,未能获取到资源源文件信息': '文件丢失,未能获取到资源源文件信息',

    '授权失败,没有操作权限': '授权失败,没有操作权限',

    '参数%s缺失': '参数%s缺失',

    '参数%s错误,合同状态机不能触发当前事件': '参数%s错误,合同状态机不能触发当前事件',

    '参数%s必须与%s组合使用': '参数%s必须与%s组合使用',

    '未找到合同交易记录或者交易已经处理完毕': '未找到合同交易记录或者交易已经处理完毕',

    '签约的授权方案中存在部分上游合同没有执行到允许再签约授权的状态': '签约的授权方案中存在部分上游合同没有执行到允许再签约授权的状态',

    '待签约列表中存在部分策略不包含再签约授权': '待签约列表中存在部分策略不包含再签约授权',

    '待签约列表中存在部分策略身份认证失败': '待签约列表中存在部分策略身份认证失败',

    '已经存在一份同样的合约,不能重复签订': '已经存在一份同样的合约,不能重复签订',

    '节点资源策略段身份认证失败,不能签约': '节点资源策略段身份认证失败,不能签约',

    '节点资源的合约链中存在未获得再签约授权的合约': '节点资源的合约链中存在未获得再签约授权的合约',

    '节点资源授权树数据缺失': '节点资源授权树数据缺失',

    '节点资源合同不完备,请检查是否全部签约': '节点资源合同不完备,请检查是否全部签约',

    '节点信息与登录用户不匹配': '节点信息与登录用户不匹配',

    '未找到节点资源签署的有效的合约信息': '未找到节点资源签署的有效的合约信息',

    '节点未签约合同': '节点未签约合同',

    '节点合同未激活': '节点合同未激活',

    '资源作者未签约合同': '资源作者未签约合同',

    '资源合同未激活': '资源合同未激活',

    '资源未获得转签授权': '资源未获得转签授权',

    '用户未签约合同': '用户未签约合同',

    '用户合同未激活': '用户合同未激活',

    '不满足乙方节点身份认证策略': '不满足乙方节点身份认证策略',

    '未找到乙方节点信息': '未找到乙方节点信息',

    '未找到乙方用户信息': '未找到乙方用户信息',

    '乙方用户认证不通过': '乙方用户认证不通过',

    '非免费策略,请签约': '非免费策略,请签约',

    '未能通过资源策略授权': '未能通过资源策略授权',

    '当前用户没有操作权限': '当前用户没有操作权限',

    '合同锁定中,系统正在计算合同数据,请稍后再': '合同锁定中,系统正在计算合同数据,请稍后再',

    '非单例事件,错误的调用': '非单例事件,错误的调用',

    '系统错误,单例事件处理函数不支持当前事件': '系统错误,单例事件处理函数不支持当前事件',

    '合同已经激活,不能重复操作': '合同已经激活,不能重复操作'
}